NordicPlayground/nrf52-ble-multi-link-multi-role/ble_aggregator/main.c
/** @brief Function for initializing the timer.
 */
static void timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
    
    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, 64);
    APP_ERROR_CHECK(err_code);
}


static void process_app_commands()
{               
    if(agg_cmd_received != 0)
    {          
        uint32_t mask;
        switch(agg_cmd_received)
        {
            case APPCMD_SET_LED_ALL:
                for(int i = 2; i >= 0; i--)
                {
                    mask = mask << 8 | agg_cmd[4 + i];
                }
                led_status_send_by_mask(agg_cmd[0], agg_cmd[1], agg_cmd[2], agg_cmd[3], mask);
                break;
                
            case APPCMD_SET_LED_ON_OFF_ALL:
                for(int i = 2; i >= 0; i--)
                {
                    mask = mask << 8 | agg_cmd[1 + i];
                }
                led_status_on_off_send_by_mask(agg_cmd[0], mask);
                break;
                
            case APPCMD_POST_CONNECT_MESSAGE:
                post_connect_message(agg_cmd[0]);
                break;
            
            case APPCMD_DISCONNECT_PERIPHERALS:
                disconnect_all_peripherals();
                break;

            case APPCMD_DISCONNECT_CENTRAL:
                sd_ble_gap_disconnect(m_per_con_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                break;
            
            default:
                break;
        }
        agg_cmd_received = 0;
    }
}


int main(void)
{
    uint32_t err_code;
    
    log_init();
    timer_init();
    uart_init();
    leds_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    app_aggregator_init(&m_agg_cfg_service);
    db_discovery_init();
    lbs_c_init();
    thingy_uis_c_init();
    ble_conn_state_init();
    advertising_data_set();

    NRF_LOG_INFO("Multilink example started");
    uart_printf("Multilink example started. Group name \"%s\"\r\n", m_target_periph_name);

    for (int i = 0; i < NRF_SDH_BLE_TOTAL_LINK_COUNT; ++i){
        m_coded_phy_conn_handle[i] = BLE_CONN_HANDLE_INVALID;
    }
    // Start scanning for peripherals and initiate connection to devices which  advertise.
    scan_start();

    // Start advertising
    advertising_start();
    
    // Turn on the LED to signal scanning.
    bsp_board_led_on(CENTRAL_SCANNING_LED);
        
    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
    
    for (;;)
    {
        if (!NRF_LOG_PROCESS())
        {
            if(m_per_con_handle != BLE_CONN_HANDLE_INVALID)
            {
                while(app_aggregator_flush_ble_commands());
            }

            process_app_commands();

            device_list_print();
            
            power_manage();
        }
    }
}
